### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np
# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [2]:
purchase_data.info()
purchase_data.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 780 entries, 0 to 779
Data columns (total 7 columns):
Purchase ID    780 non-null int64
SN             780 non-null object
Age            780 non-null int64
Gender         780 non-null object
Item ID        780 non-null int64
Item Name      780 non-null object
Price          780 non-null float64
dtypes: float64(1), int64(3), object(3)
memory usage: 42.8+ KB

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [3]:
#create players table without duplicates
player_nodup = purchase_data.loc[:, [ "SN", "Age", "Gender"]]
player_nodup = player_nodup.drop_duplicates(["SN"],keep="first")
player_nodup.head()

              SN  Age Gender
0        Lisim78   20   Male
1    Lisovynya38   40   Male
2     Ithergue48   24   Male
3  Chamassasya86   24   Male
4      Iskosia90   23   Male

## Player Count

* Display the total number of players

In [4]:
total_players=player_nodup.count()[0]
pd.DataFrame({"Total Players":[total_players]})

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
#obtain number of unique items, first use unique to get a list of unique items, use len() to get the number
item_unique=purchase_data["Item ID"].unique()
num_uni_item=len(item_unique)
num_uni_item

183

In [6]:
#obtain the average price by using mean
avg_price=purchase_data["Price"].mean()
avg_price

3.050987179487176

In [7]:
#obtain the number of purchases by using count
num_purchases=purchase_data["Purchase ID"].count()
num_purchases

780

In [8]:
#obtain the total revenue by using sum
total_rev=purchase_data["Price"].sum()
total_rev

2379.77

In [9]:
#create dataframe for three variables
summary_df=pd.DataFrame({"Number of Unique Items":[num_uni_item],"Average Price":[avg_price],"Number of Purchases":[num_purchases],"Total Revenue":[total_rev]})
#use map to format
summary_df["Average Price"]=summary_df["Average Price"].map("${:.2f}".format)
summary_df["Total Revenue"]=summary_df["Total Revenue"].map("${:,}".format)
summary_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
#obtain all the unique values for Gender
purchase_data["Gender"].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [11]:
#obtain the number and percent of male players
male_df=purchase_data.loc[purchase_data["Gender"]=="Male",:]
male_df
num_male=len(male_df["SN"].unique())
num_male
pct_male=num_male/total_players*100
pct_male

84.02777777777779

In [12]:
#obtain the number and percent of female players
female_df=purchase_data.loc[purchase_data["Gender"]=="Female",:]
female_df
num_female=len(female_df["SN"].unique())
num_female
pct_female=num_female/total_players*100
pct_female

14.0625

In [13]:
#obtain the number and percent of Other / Non-Disclosed
other_df=purchase_data.loc[purchase_data["Gender"]=="Other / Non-Disclosed",:]
other_df
num_other=len(other_df["SN"].unique())
num_other
pct_other=num_other/total_players*100
pct_other

1.9097222222222223

In [14]:
#create dataframe for gender number and percentage
gender_summary_df=pd.DataFrame({"Total Count":[num_male,num_female,num_other],"Percentage of Players":[pct_male,pct_female,pct_other]},index=["Male","Female","Other / Non-Disclosed"])

#use map to format
gender_summary_df["Percentage of Players"]=gender_summary_df["Percentage of Players"].map("{:.2f}%".format)
gender_summary_df

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
#select purchase id, price and gender to create new dataframe
gender_purchase=purchase_data[["Price","Gender"]]
gender_purchase.head()

   Price Gender
0   3.53   Male
1   1.56   Male
2   4.88   Male
3   3.27   Male
4   1.44   Male

In [16]:
#calculate purchase count
purchase_counts=gender_purchase["Gender"].value_counts()
purchase_counts

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [17]:
#using groupby to separate the data based on "Gender"
grouped_gp_purchase=gender_purchase.groupby(["Gender"])
#calculate avg purchase price by using groupby mean
avg_pur_price=grouped_gp_purchase["Price"].mean()

avg_pur_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [18]:
#calculate total purchase price by groupby sum
total_pur_price=grouped_gp_purchase["Price"].sum()

total_pur_price

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [19]:
#calculate avg tatal purchase per person
avg_total=total_pur_price/gender_summary_df["Total Count"]
avg_total

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [20]:
#create dataframe for purchase analysis(gender)

purchase_analy_df=pd.DataFrame({"Purchase Count":purchase_counts,"Average Purchase Price":avg_pur_price,
                                "Total Purchase Value":total_pur_price,"Avg Total Purchase per Person":avg_total},
                                index=["Female","Male","Other / Non-Disclosed"])
#set index name "Gender"
purchase_analy_df.index.name='Gender'

#use map to format
purchase_analy_df["Average Purchase Price"]=purchase_analy_df["Average Purchase Price"].map("${:.2f}".format)
purchase_analy_df["Total Purchase Value"]=purchase_analy_df["Total Purchase Value"].map("${:,.2f}".format)
purchase_analy_df["Avg Total Purchase per Person"]=purchase_analy_df["Avg Total Purchase per Person"].map("${:.2f}".format)
purchase_analy_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [21]:
#set up bins
bins=[0,9,14,19,24,29,34,39,100]
#create the names for the bins
bin_name=["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [22]:
player_nodup["Age Summary"]=pd.cut(player_nodup["Age"],bins,labels=bin_name)
player_nodup

                SN  Age  Gender Age Summary
0          Lisim78   20    Male       20-24
1      Lisovynya38   40    Male         40+
2       Ithergue48   24    Male       20-24
3    Chamassasya86   24    Male       20-24
4        Iskosia90   23    Male       20-24
..             ...  ...     ...         ...
773         Hala31   21    Male       20-24
774     Jiskjask80   11    Male       10-14
775     Aethedru70   21  Female       20-24
777     Yathecal72   20    Male       20-24
778        Sisur91    7    Male         <10

[576 rows x 4 columns]

In [23]:
# Calculate the Numbers and Percentages by Age Group
age_bin_totals = player_nodup["Age Summary"].value_counts()
age_bin_pct = age_bin_totals / total_players * 100
age_dem = pd.DataFrame({"Total Count": age_bin_totals, "Percentage of Players": age_bin_pct})


#use map to format
age_dem["Percentage of Players"]=age_dem["Percentage of Players"].map("{:.2f}%".format)
age_dem
# Display Age Demographics Table
age_dem.sort_index()

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [24]:
purchase_data["Age Summary"]=pd.cut(purchase_data["Age"],bins,labels=bin_name)

purchase_counts=purchase_data["Age Summary"].value_counts(sort=False)
purchase_counts

<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age Summary, dtype: int64

In [25]:
#using groupby to separate the data based on "Age Summary"
grouped_age_purchase=purchase_data.groupby(["Age Summary"])
#calculate avg purchase price by using groupby mean
avg_pur_price=grouped_age_purchase["Price"].mean()

avg_pur_price

Age Summary
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [26]:
#calculate total purchase price by groupby sum
total_pur_price=grouped_age_purchase["Price"].sum()

total_pur_price

Age Summary
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [27]:
#calculate avg tatal purchase per person
avg_total=total_pur_price/age_dem["Total Count"]
avg_total

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [28]:
#create dataframe for purchase analysis(age summary)

purchase_analy_df=pd.DataFrame({"Purchase Count":purchase_counts,"Average Purchase Price":avg_pur_price,
                                "Total Purchase Value":total_pur_price,"Avg Total Purchase per Person":avg_total})

# #set index name "Age Ranges"
purchase_analy_df.index.name='Age Ranges'

# #use map to format
purchase_analy_df["Average Purchase Price"]=purchase_analy_df["Average Purchase Price"].map("${:.2f}".format)
purchase_analy_df["Total Purchase Value"]=purchase_analy_df["Total Purchase Value"].map("${:,.2f}".format)
purchase_analy_df["Avg Total Purchase per Person"]=purchase_analy_df["Avg Total Purchase per Person"].map("${:.2f}".format)
purchase_analy_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [30]:
grouped_sn_purchase=purchase_data.groupby("SN")

In [31]:
#get the number of puchase count for each SN
purchase_counts = grouped_sn_purchase["Item ID"].count()
#calculate avg purchase price by using groupby mean
avg_pur_price = grouped_sn_purchase["Price"].mean()
#calculate the total purchase value for each SN
total_pur_price = purchase_counts * avg_pur_price
#create dataframe for purchase analysis(SN)
top_spend_array = {"Purchase Count": purchase_counts, "Average Purchase Price": avg_pur_price, "Total Purchase Value": total_pur_price}
top_spend_df = pd.DataFrame(top_spend_array, index = player_nodup["SN"])
top_spend_df = top_spend_df.sort_values('Total Purchase Value', ascending = False)
#use map to format
top_spend_df['Average Purchase Price'] = top_spend_df['Average Purchase Price'].map('${:,.2f}'.format)
top_spend_df['Total Purchase Value'] = top_spend_df['Total Purchase Value'].map('${:,.2f}'.format)
#Preview
top_spend_df.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [32]:
#Retrieve the Item ID, Item Name, and Item Price columns
item_df=pd.DataFrame(purchase_data[[ "Item ID", "Item Name", "Price"]])

In [33]:
#group by item 
group_item = item_df.groupby(['Item ID','Item Name'])
group_item.head()

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
766       58          Freak's Bite, Favor of Holy Might   4.14
774      101                               Final Critic   4.19
777       67      Celeste, Incarnation of the Corrupted   3.46
778      101                               Final Critic   4.19
779       50                                       Dawn   4.60

[697 rows x 3 columns]

In [34]:
#create purchase count, item price and total purchase value
purhase_counts = group_item['Item ID'].count()
item_price = group_item['Price'].mean()
total_pur_value = purhase_counts * item_price

In [35]:
#create dataframe to hold the all the variable created above
popular_items = {'Purchase Count': purhase_counts, 'Item Price': item_price, 'Total Purchase Value': total_pur_value}
popular_items = pd.DataFrame(popular_items)
#sort the dataframe descending by purchase count
popular_items = popular_items.sort_values("Purchase Count", ascending = False)
#use map to format
popular_items['Item Price'] = popular_items['Item Price'].map('${:,.2f}'.format)
popular_items['Total Purchase Value'] = popular_items['Total Purchase Value'].map('${:,.2f}'.format)
popular_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [36]:
#Retrieve the Item ID, Item Name, and Item Price columns
item_df=pd.DataFrame(purchase_data[[ "Item ID", "Item Name", "Price"]])
#group by item 
group_item = item_df.groupby(['Item ID','Item Name'])
group_item.head()
#create purchase count, item price and total purchase value
purhase_counts = group_item['Item ID'].count()
item_price = group_item['Price'].mean()
total_pur_value = purhase_counts * item_price
#create dataframe to hold the all the variable created above
profit_items = {'Purchase Count': purhase_counts, 'Item Price': item_price, 'Total Purchase Value': total_pur_value}
profit_items = pd.DataFrame(profit_items)
#sort the dataframe descending by purchase count
profit_items = profit_items.sort_values("Total Purchase Value", ascending = False)
#use map to format
profit_items['Item Price'] = profit_items['Item Price'].map('${:,.2f}'.format)
profit_items['Total Purchase Value'] = profit_items['Total Purchase Value'].map('${:,.2f}'.format)
profit_items.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80